dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/COMP1_1.0.xml
        </group>
    <register id="COMP1_EVT_MODE" width="32" offset="0x10E0" description="Event Mode">
        <bitfield id="INT0_CFG" description="Event line mode select for event corresponding to CPU_INT" begin="1" end="0" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="Event handled by software. Software must clear the associated RIS flag."/>
            <bitenum id="HARDWARE" value="0x2" description="Event handled by hardware. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
        <bitfield id="EVT1_CFG" description="Event line mode select for event corresponding to GEN_EVENT" begin="3" end="2" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="Event handled by software. Software must clear the associated RIS flag."/>
            <bitenum id="HARDWARE" value="0x2" description="Event handled by hardware. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
    </register>
    <register id="COMP1_DESC" width="32" offset="0x10FC" description="Module Description">
        <bitfield id="MINREV" description="Minor rev of the IP" begin="3" end="0" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="MAJREV" description="Major rev of the IP" begin="7" end="4" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="FEATUREVER" description="Feature Set for the module *instance*" begin="15" end="12" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="MODULEID" description="Module identification contains a unique peripheral identification number. The assignments are maintained in a central database for all of the platform modules to ensure uniqueness." begin="31" end="16" width="16" rwaccess="R">
        </bitfield>
    </register>
    <register id="COMP1_CTL0" width="32" offset="0x1100" description="Control 0">
        <bitfield id="IPSEL" description="Channel input selected for the positive terminal of the comparator if IPEN is set to 1." begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="CH_0" value="0x0" description="Channel 0 selected"/>
            <bitenum id="CH_1" value="0x1" description="Channel 1 selected"/>
            <bitenum id="CH_2" value="0x2" description="Channel 2 selected"/>
            <bitenum id="CH_3" value="0x3" description="Channel 3 selected"/>
            <bitenum id="CH_4" value="0x4" description="Channel 4 selected"/>
            <bitenum id="CH_5" value="0x5" description="Channel 5 selected"/>
            <bitenum id="CH_6" value="0x6" description="Channel 6 selected"/>
            <bitenum id="CH_7" value="0x7" description="Channel 7  selected"/>
        </bitfield>
        <bitfield id="IPEN" description="Channel input enable for the positive terminal of the comparator." begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Selected analog input channel for positive terminal is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Selected analog input channel for positive terminal is enabled"/>
        </bitfield>
        <bitfield id="IMEN" description="Channel input enable for the negative terminal of the comparator." begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Selected analog input channel for negative terminal is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Selected analog input channel for negative terminal is enabled"/>
        </bitfield>
        <bitfield id="IMSEL" description="Channel input selected for the negative terminal of the comparator if IMEN is set to 1." begin="18" end="16" width="3" rwaccess="R/W">
            <bitenum id="CH_0" value="0x0" description="Channel 0 selected"/>
            <bitenum id="CH_1" value="0x1" description="Channel 1 selected"/>
            <bitenum id="CH_2" value="0x2" description="Channel 2 selected"/>
            <bitenum id="CH_3" value="0x3" description="Channel 3 selected"/>
            <bitenum id="CH_4" value="0x4" description="Channel 4 selected"/>
            <bitenum id="CH_5" value="0x5" description="Channel 5 selected"/>
            <bitenum id="CH_6" value="0x6" description="Channel 6 selected"/>
            <bitenum id="CH_7" value="0x7" description="Channel 7 selected"/>
        </bitfield>
    </register>
    <register id="COMP1_CTL1" width="32" offset="0x1104" description="Control 1">
        <bitfield id="ENABLE" description="This bit turns on the comparator. When the comparator is turned off it consumes no power." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="Comparator is off"/>
            <bitenum id="ON" value="0x1" description="Comparator is on"/>
        </bitfield>
        <bitfield id="MODE" description="This bit selects the comparator operating mode." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="FAST" value="0x0" description="Comparator is in fast mode"/>
            <bitenum id="ULP" value="0x1" description="Comparator is in ultra-low power mode"/>
        </bitfield>
        <bitfield id="EXCH" description="This bit exchanges the comparator inputs and inverts the comparator output." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="NO_EXC" value="0x0" description="Comparator inputs not exchanged and output not inverted"/>
            <bitenum id="EXC" value="0x1" description="Comparator inputs exchanged and output inverted"/>
        </bitfield>
        <bitfield id="SHORT" description="This bit shorts the positive and negative input terminals of the comparator." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="NO_SHT" value="0x0" description="Comparator positive and negative input terminals are not shorted"/>
            <bitenum id="SHT" value="0x1" description="Comparator positive and negative input terminals are shorted"/>
        </bitfield>
        <bitfield id="IES" description="This bit selected the interrupt edge for COMPIFG and COMPINVIFG." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="RISING" value="0x0" description="Rising edge sets COMPIFG and falling edge sets COMPINVIFG"/>
            <bitenum id="FALLING" value="0x1" description="Falling edge sets COMPIFG and rising edge sets COMPINVIFG"/>
        </bitfield>
        <bitfield id="HYST" description="These bits select the hysteresis setting of the comparator." begin="6" end="5" width="2" rwaccess="R/W">
            <bitenum id="NO_HYS" value="0x0" description="No hysteresis"/>
            <bitenum id="LOW_HYS" value="0x1" description="Low hysteresis, typical 10mV"/>
            <bitenum id="MED_HYS" value="0x2" description="Medium hysteresis, typical 20mV"/>
            <bitenum id="HIGH_HYS" value="0x3" description="High hysteresis, typical 30mV"/>
        </bitfield>
        <bitfield id="OUTPOL" description="This bit selects the comparator output polarity." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="NON_INV" value="0x0" description="Comparator output is non-inverted"/>
            <bitenum id="INV" value="0x1" description="Comparator output is inverted"/>
        </bitfield>
        <bitfield id="FLTEN" description="This bit enables the analog filter at comparator output." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Comparator output filter is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Comparator output filter is enabled"/>
        </bitfield>
        <bitfield id="FLTDLY" description="These bits select the comparator output filter delay. See the device-specific data sheet for specific values on comparator propagation delay for different filter delay settings." begin="10" end="9" width="2" rwaccess="R/W">
            <bitenum id="DLY_0" value="0x0" description="Typical filter delay of 70 ns"/>
            <bitenum id="DLY_1" value="0x1" description="Typical filter delay of 500 ns"/>
            <bitenum id="DLY_2" value="0x2" description="Typical filter delay of 1200 ns"/>
            <bitenum id="DLY_3" value="0x3" description="Typical filter delay of 2700 ns"/>
        </bitfield>
        <bitfield id="WINCOMPEN" description="This bit enables window comparator operation of comparator." begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="window comparator is disable"/>
            <bitenum id="ON" value="0x1" description="window comparator is enable"/>
        </bitfield>
    </register>
    <register id="COMP1_CTL2" width="32" offset="0x1108" description="Control 2">
        <bitfield id="REFMODE" description="This bit requests ULP_REF bandgap operation in fast mode(static) or low power mode (sampled). The local reference buffer and 8-bit DAC inside comparator module are also configured accordingly. 
Fast mode operation offers higher accuracy but consumes higher current. Low power operation consumes lower current but with relaxed reference voltage accuracy. Comparator requests for reference voltage from ULP_REF only when REFLVL &gt; 0." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="STATIC" value="0x0" description="ULP_REF bandgap, local reference buffer and 8-bit DAC inside comparator operate in static mode."/>
            <bitenum id="SAMPLED" value="0x1" description="ULP_REF bandgap, local reference buffer and 8-bit DAC inside comparator operate in sampled mode."/>
        </bitfield>
        <bitfield id="REFSRC" description="These bits select the reference source for the comparator." begin="5" end="3" width="3" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="Reference voltage generator is disabled (local reference buffer as well as DAC)."/>
            <bitenum id="VDDA_DAC" value="0x1" description="VDDA selected as the reference source to DAC and DAC output applied as reference to comparator."/>
            <bitenum id="VREF_DAC" value="0x2" description="VREF selected as reference to DAC and DAC output applied as reference to comparator."/>
            <bitenum id="VREF" value="0x3" description="In devices where internal VREF is buffered and hookedup to extrernal VREF pin, VREF applied as reference to comparator. DAC is switched off.  Note: In LEGO_A3, DAC is turned off in this selection, in other deviced DAC is kept on."/>
            <bitenum id="VDDA" value="0x5" description="VDDA is used as comparator reference. Note: In LEGO_A3, DAC is turned off in this selection, in other deviced DAC is kept on."/>
            <bitenum id="INTVREF_DAC" value="0x6" description="Internal reference selected as the reference source to DAC and DAC output applied as reference to comparator."/>
            <bitenum id="INTVREF" value="0x7" description="Internal VREF is used as the source of comparator. Not all devices will have this option."/>
        </bitfield>
        <bitfield id="REFSEL" description="This bit selects if the selected reference voltage is applied to positive or negative terminal of the comparator." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="POSITIVE" value="0x0" description="If EXCH bit is 0, the selected reference is applied to positive terminal. If EXCH bit is 1, the selected reference is applied to negative terminal."/>
            <bitenum id="NEGATIVE" value="0x1" description="If EXCH bit is 0, the selected reference is applied to negative terminal. If EXCH bit is 1, the selected reference is applied to positive terminal."/>
        </bitfield>
        <bitfield id="DACCTL" description="This bit determines if the comparator output or DACSW bit controls the selection between DACCODE0 and DACCODE1." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="COMPOUT_SEL" value="0x0" description="Comparator output controls selection between DACCODE0 and DACCODE1"/>
            <bitenum id="DACSW_SEL" value="0x1" description="DACSW bit controls selection between DACCODE0 and DACCODE1"/>
        </bitfield>
        <bitfield id="DACSW" description="This bit selects between DACCODE0 and DACCODE1 to 8-bit DAC when DACCTL bit is 1." begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="DACCODE0_SEL" value="0x0" description="DACCODE0 selected for 8-bit DAC"/>
            <bitenum id="DACCODE1_SEL" value="0x1" description="DACCODE1 selected for 8-bit DAC"/>
        </bitfield>
        <bitfield id="BLANKSRC" description="These bits select the blanking source for the comparator." begin="10" end="8" width="3" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Blanking source disabled"/>
            <bitenum id="BLANKSRC1" value="0x1" description="Select Blanking Source 1"/>
            <bitenum id="BLANKSRC2" value="0x2" description="Select Blanking Source 2"/>
            <bitenum id="BLANKSRC3" value="0x3" description="Select Blanking Source 3"/>
            <bitenum id="BLANKSRC4" value="0x4" description="Select Blanking Source 4"/>
            <bitenum id="BLANKSRC5" value="0x5" description="Select Blanking Source 5"/>
            <bitenum id="BLANKSRC6" value="0x6" description="Select Blanking Source 6"/>
        </bitfield>
        <bitfield id="SAMPMODE" description="Enable sampled mode of comparator." begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Sampled mode disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Sampled mode enabled"/>
        </bitfield>
    </register>
    <register id="COMP1_CTL3" width="32" offset="0x110C" description="Control 3">
        <bitfield id="DACCODE0" description="This is the first 8-bit DAC code. When the DAC code is 0x0 the DAC output will be 0 V. When the DAC code is 0xFF the DAC output will be selected reference voltage x 255/256." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MNIMUM" value="0x0" description="Minimum DAC code value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Minimum DAC code value"/>
        </bitfield>
        <bitfield id="DACCODE1" description="This is the second 8-bit DAC code. When the DAC code is 0x0 the DAC output will be 0 V. When the DAC code is 0xFF the DAC output will be selected reference voltage x 255/256." begin="23" end="16" width="8" rwaccess="R/W">
            <bitenum id="MNIMUM" value="0x0" description="Minimum DAC code value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Minimum DAC code value"/>
        </bitfield>
    </register>
    <register id="COMP1_STAT" width="32" offset="0x1120" description="Status">
        <bitfield id="OUT" description="This bit reflects the value of the comparator output. Writing to this bit has no effect on the comparator output." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="LOW" value="0x0" description="Comparator output is low"/>
            <bitenum id="HIGH" value="0x1" description="Comparator output is high"/>
        </bitfield>
    </register>

</module>